<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"bb17c32e8a9139855bad6bfecc77952cc93d1ffca323dfee35195b6e5a014824","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1350 at https://github.com/cal-itp/data-infra/actions/runs/20973448104","plan_out_hash":"a7561d020bc1c0045c39de443e547ac8bd3a2b0b29f09e14d168cc90992f57a5","plan_hash":"ccf7289efda4cb45b167a9a8579c77be9cee822d387810553944c75bc6710be5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "hn2Mcw==" -> (known after apply)
!~      detect_md5hash      = "qwUd82Z30Y29GoeVS8qZSQ==" -> "different hash"
!~      generation          = 1768335715080491 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "qwUd82Z30Y29GoeVS8qZSQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/dim_stop_arrivals.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "TwvSgw==" -> (known after apply)
!~      detect_md5hash      = "32iiueYjkLs4sm4MjqGcVQ==" -> "different hash"
!~      generation          = 1767978423866385 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
!~      md5hash             = "32iiueYjkLs4sm4MjqGcVQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_daily_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "hA4ZpQ==" -> (known after apply)
!~      detect_md5hash      = "cKNseZ4EHgkLT2YfVngOlg==" -> "different hash"
!~      generation          = 1764958906048990 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
!~      md5hash             = "cKNseZ4EHgkLT2YfVngOlg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/payments/_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "u7oQTQ==" -> (known after apply)
!~      detect_md5hash      = "wLmnrdN+f5tBA3MWS+icfg==" -> "different hash"
!~      generation          = 1757032590670911 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/payments/_payments.yml"
!~      md5hash             = "wLmnrdN+f5tBA3MWS+icfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "OcaTag==" -> (known after apply)
!~      detect_md5hash      = "HmJeCvajFDILve4ocXKRUw==" -> "different hash"
!~      generation          = 1768335716796384 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "HmJeCvajFDILve4ocXKRUw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1350](https://github.com/cal-itp/data-infra/actions/runs/20973448104)